In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [6]:
d1=pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [5]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [8]:
dict2={'Names':['Aravind','Samar',None,'Siri'],
       'Age':[None,21,32,43],
       'City':['Hyd','Blr','Chennai',None]}
pd.DataFrame(dict2)

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2     None  32.0  Chennai
3     Siri  43.0     None

In [12]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [13]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

- np.nan: not a number this appicable for numerical columns only

- Generally data has some empty rows

- It is a data problem

- If you read that kind of data  you will see null

- You need to understand it is a data corrupted or really a Null values are there

### method-1

In [15]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [16]:
d1.fillna(40)

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2       40  32.0  Chennai
3     Siri  43.0       40

**method2**

- we can fill the values w.r.t columns also

In [17]:
d1['Age'].fillna(40)
# it is not update
# inplace=False

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [18]:
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [19]:
d1['Age'].fillna(40,inplace=True)

In [20]:
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [23]:
d1['Names'].fillna('Mrx',inplace=True)

In [24]:
d1['City'].fillna('Berhampur',inplace=True)

In [25]:
d1

     Names   Age       City
0  Aravind  40.0        Hyd
1    Samar  21.0        Blr
2      Mrx  32.0    Chennai
3     Siri  43.0  Berhampur

In [26]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
d1=pd.DataFrame(dict1)

In [28]:
d1.fillna(method='bfill')

C:\Users\kanhu\AppData\Local\Temp\ipykernel_100\1914124427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  Chennai
3     Siri  43.0      NaN

In [29]:
d1.fillna(method='ffill')

C:\Users\kanhu\AppData\Local\Temp\ipykernel_100\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [30]:
d1.fillna(method='pad')

C:\Users\kanhu\AppData\Local\Temp\ipykernel_100\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [33]:
d1.fillna(method='backfill',axis=1)

C:\Users\kanhu\AppData\Local\Temp\ipykernel_100\3586447502.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill',axis=1)

     Names   Age     City
0  Aravind   Hyd      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  Chennai
3     Siri  43.0      NaN

- backfill and bill fill with next value

- Pad and ffill fill with previous value

- but it will change based on axis

#### method-4

- mean

    - Numerical values can fill with mean value
 
    - but mean affect by outliers
 
    - if we dont have outliers it is best one

- median

      - Numerical values can fill with median value

- mode

In [34]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
d1=pd.DataFrame(dict1)
# we already know we can fill with some values based on specific column using

In [35]:
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [36]:
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [37]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [38]:
age_mode=d1['Age'].mode()
d1['Age'].fillna(age_mode)

0    21.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [39]:
d1['City'].mode()

0        Blr
1    Chennai
2        Hyd
Name: City, dtype: object

- Fill with random

In [ ]:
**Method_5**

**KNN imputer**

- KNN: K neartest Neighbours

- K is a hyper paramter means user can choose

- It is distance metric: **Euclidian Distance**

- KNN imputer will

In [41]:
from sklearn.impute import KNNImputer
knn=KNNImputer()
knn.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])